eisup_2019_docmng_integration/src/Catalogs/абс_ТипыКонтрагентов/абс_ТипыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ТипыКонтрагентов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ИностранныеОрганизации</name>
      <description>Иностранные организации</description>
    </items>
    <items>
      <name>РоссийскиеКонтрагенты</name>
      <description>Российские контрагенты</description>
        </content>
        </content>
        </content>
      </content>
      </content>
      </content>
      </content>
    </items>
  </predefined>
  <attributes>
    <name>НеЯвляетсяРезидентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыАСБ</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыАСБ/абс_СтатусыАСБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыАСБ</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНСИ</name>
  </enumValues>
  <enumValues>
    <name>Активный</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>Заполнение</name>
  </enumValues>
  <enumValues>
    <name>Сформирован</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеВыгрузки</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/абс_ТипыКонтрагентов/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтоГруппа Тогда 
		абс_Статус = Перечисления.абс_СтатусыАСБ.Подготовка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ЭтоГруппа Тогда 
		абс_Статус = Перечисления.абс_СтатусыАСБ.Подготовка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РегистрыСведений.абс_ИсторияСтатусовАСБ.ЗаписатьСтатус(Ссылка, абс_Статус, ДополнительныеСвойства);
	
КонецПроцедуры
